# -*- coding: utf-8 -*-

"""
Use python3.8

Таблица маршрутов между городами
"""


ROUTE_TABLE = {
    'Амстердам': ['Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва', 'Нью-Йорк',
                  'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Берлин': ['Амстердам', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва', 'Нью-Йорк',
               'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Буэнос-Айрес': ['Амстердам', 'Берлин', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва', 'Нью-Йорк',
                     'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Лондон': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лос-Анджелес', 'Мадрид', 'Москва', 'Нью-Йорк',
               'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Лос-Анджелес': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Мадрид', 'Москва', 'Нью-Йорк',
                     'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Мадрид': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Москва', 'Нью-Йорк',
               'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Москва': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Нью-Йорк',
               'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Нью-Йорк': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
                 'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Париж': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
              'Нью-Йорк', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Пекин': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
              'Нью-Йорк', 'Париж', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Рим': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
            'Нью-Йорк', 'Париж', 'Пекин', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней', 'Токио'],

    'Рио-де-Жанейро': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
                       'Нью-Йорк', 'Париж', 'Пекин', 'Рим', 'Сидней', 'Токио'],

    'Санкт-Петербург': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
                        'Нью-Йорк', 'Париж', 'Пекин', 'Рим', 'Сидней', 'Токио'],

    'Сидней': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
               'Нью-Йорк', 'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Токио'],

    'Токио': ['Амстердам', 'Берлин', 'Буэнос-Айрес', 'Лондон', 'Лос-Анджелес', 'Мадрид', 'Москва',
              'Нью-Йорк', 'Париж', 'Пекин', 'Рим', 'Рио-де-Жанейро', 'Санкт-Петербург', 'Сидней']
}
